; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v10 ?v8)
             (pred_9 ?v7 ?v5)
             (pred_11 ?v10 ?v5)
             (pred_4 ?v1 ?v10 )
	     (pred_12 ?v10)
             (pred_1 ?v12)
             (pred_8 ?v7)
             (pred_3 ?v5)
             (pred_2 ?v10)
             (pred_10 ?v7)
             (pred_5 ?v10)
             (pred_6 ))



(:action op_4
:parameters (?v4 ?v13 ?v2 ?v11)
:precondition (and (pred_1 ?v4) (pred_1 ?v13) (pred_8 ?v2) (pred_3 ?v11)
          (pred_7 ?v4 ?v13) (pred_9 ?v2 ?v11)
                   (pred_11 ?v13 ?v11) (pred_12 ?v4) 
                   (pred_2 ?v13) (pred_10 ?v2))
:effect (and  (pred_5 ?v13) (not (pred_2 ?v13))))


(:action op_2
:parameters (?v4 ?v9)
:precondition (and (pred_1 ?v4) (pred_1 ?v9)
               (pred_12 ?v4) (pred_7 ?v4 ?v9) (pred_5 ?v9))
:effect (and (pred_12 ?v9) (not (pred_12 ?v4))))

(:action op_3
:parameters (?v4 ?v2)
:precondition (and (pred_1 ?v4) (pred_8 ?v2) 
                  (pred_12 ?v4) (pred_4 ?v2 ?v4) (pred_6 ))
:effect (and (pred_10 ?v2)
   (not (pred_4 ?v2 ?v4)) (not (pred_6 ))))


(:action op_5
:parameters (?v4 ?v6 ?v3)
:precondition (and (pred_1 ?v4) (pred_8 ?v6) (pred_8 ?v3)
                  (pred_12 ?v4) (pred_10 ?v3) (pred_4 ?v6 ?v4))
:effect (and (pred_10 ?v6) (pred_4 ?v3 ?v4)
        (not (pred_10 ?v3)) (not (pred_4 ?v6 ?v4))))

(:action op_1
:parameters (?v4 ?v2)
:precondition (and (pred_1 ?v4) (pred_8 ?v2) 
                  (pred_12 ?v4) (pred_10 ?v2))
:effect (and (pred_6 ) (pred_4 ?v2 ?v4) (not (pred_10 ?v2)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_14 obj_15 obj_12 obj_06 obj_22 obj_17 obj_09 obj_02 obj_01 obj_13 obj_10 obj_11 obj_07 obj_18 obj_08 obj_04
    obj_03 obj_19 obj_05
    obj_21 obj_20 obj_16
    )

    (:init
       (pred_6)

       (pred_1 obj_14)
       (pred_1 obj_15)
       (pred_1 obj_12)
       (pred_1 obj_06)
       (pred_1 obj_22)
       (pred_1 obj_17)
       (pred_1 obj_09)
       (pred_1 obj_02)
       (pred_1 obj_01)
       (pred_1 obj_13)
       (pred_1 obj_10)
       (pred_1 obj_11)
       (pred_1 obj_07)
       (pred_1 obj_18)
       (pred_1 obj_08)
       (pred_1 obj_04)
       (pred_3 obj_03)
       (pred_3 obj_19)
       (pred_3 obj_05)
       (pred_8 obj_21)
       (pred_8 obj_20)
       (pred_8 obj_16)

       (pred_7 obj_14 obj_22)
       (pred_7 obj_14 obj_15)
       (pred_7 obj_15 obj_17)
       (pred_7 obj_15 obj_12)
       (pred_7 obj_15 obj_14)
       (pred_7 obj_12 obj_09)
       (pred_7 obj_12 obj_06)
       (pred_7 obj_12 obj_15)
       (pred_7 obj_06 obj_02)
       (pred_7 obj_06 obj_12)
       (pred_7 obj_22 obj_01)
       (pred_7 obj_22 obj_17)
       (pred_7 obj_22 obj_14)
       (pred_7 obj_17 obj_13)
       (pred_7 obj_17 obj_09)
       (pred_7 obj_17 obj_15)
       (pred_7 obj_17 obj_22)
       (pred_7 obj_09 obj_10)
       (pred_7 obj_09 obj_02)
       (pred_7 obj_09 obj_12)
       (pred_7 obj_09 obj_17)
       (pred_7 obj_02 obj_11)
       (pred_7 obj_02 obj_06)
       (pred_7 obj_02 obj_09)
       (pred_7 obj_01 obj_07)
       (pred_7 obj_01 obj_13)
       (pred_7 obj_01 obj_22)
       (pred_7 obj_13 obj_18)
       (pred_7 obj_13 obj_10)
       (pred_7 obj_13 obj_17)
       (pred_7 obj_13 obj_01)
       (pred_7 obj_10 obj_08)
       (pred_7 obj_10 obj_11)
       (pred_7 obj_10 obj_09)
       (pred_7 obj_10 obj_13)
       (pred_7 obj_11 obj_04)
       (pred_7 obj_11 obj_02)
       (pred_7 obj_11 obj_10)
       (pred_7 obj_07 obj_18)
       (pred_7 obj_07 obj_01)
       (pred_7 obj_18 obj_08)
       (pred_7 obj_18 obj_13)
       (pred_7 obj_18 obj_07)
       (pred_7 obj_08 obj_04)
       (pred_7 obj_08 obj_10)
       (pred_7 obj_08 obj_18)
       (pred_7 obj_04 obj_11)
       (pred_7 obj_04 obj_08)
       (pred_2 obj_18)
       (pred_2 obj_11)
       (pred_2 obj_14)
       (pred_11  obj_18 obj_03)
       (pred_11  obj_11 obj_19)
       (pred_11  obj_14 obj_05)
       (pred_5 obj_15)
       (pred_5 obj_12)
       (pred_5 obj_06)
       (pred_5 obj_22)
       (pred_5 obj_17)
       (pred_5 obj_09)
       (pred_5 obj_02)
       (pred_5 obj_01)
       (pred_5 obj_13)
       (pred_5 obj_10)
       (pred_5 obj_07)
       (pred_5 obj_08)
       (pred_5 obj_04)

       (pred_9  obj_21 obj_03)
       (pred_9  obj_20 obj_19)
       (pred_9  obj_16 obj_05)
       (pred_4 obj_21 obj_10)
       (pred_4 obj_20 obj_18)
       (pred_4 obj_16 obj_17)
       (pred_12 obj_13)
    )

    (:goal (and
       (pred_4 obj_16 obj_08)
    ))
(:constraints
  (always (not (pred_12 obj_09)))
)
)

; plan
1. (op_2 obj_13 obj_17)
   deleted: (pred_12 obj_13)
   added: (pred_12 obj_17)
   goals met: 0 of 1
2. (op_3 obj_17 obj_16)
   deleted: (pred_4 obj_16 obj_17) (pred_6)
   added: (pred_10 obj_16)
   goals met: 0 of 1
3. (op_2 obj_17 obj_13)
   deleted: (pred_12 obj_17)
   added: (pred_12 obj_13)
   goals met: 0 of 1
4. (op_2 obj_13 obj_10)
   deleted: (pred_12 obj_13)
   added: (pred_12 obj_10)
   goals met: 0 of 1
5. (op_2 obj_10 obj_08)
   deleted: (pred_12 obj_10)
   added: (pred_12 obj_08)
   goals met: 0 of 1
6. (op_1 obj_08 obj_16)
   deleted: (pred_10 obj_16)
   added: (pred_6) (pred_4 obj_16 obj_08)
   goals met: 1 of 1
